lxl-git05/STM32/JX-Fork/JX-DaoLiBai/JX-DaoLiBai-Template/Software/MyPID.c
#include "stm32f1xx.h"                  // Device header
#include "main.h"
#include "math.h"
#include "MyPID.h"

// 用来一般化初始化PID结构体
void PID_Init(Pid_Typedef *pid, float kp, float ki, float kd , float OutMax , float OutMin , float ioutMax , float dt_ms)
{
	pid->Kp = kp;
	pid->Ki = ki;
	pid->Kd = kd;
	
	pid->OutMax = OutMax 	 ;	// 输出限幅最大值
	pid->OutMin = OutMin 	 ;	// 输出限幅最小值
	pid->ioutMax = ioutMax ;	// 积分限幅
	pid->dt_ms = dt_ms;
}

// PID值更新,更新值直接写入PID的Output
void PID_Update(Pid_Typedef *pid, float ActualValue)
{
	// 更新上次误差
	pid->LastError = pid->PreError;
	// 得到本次误差
	pid->PreError = pid->goalPoint - ActualValue;
	// 更新真实值(Actual)
	pid->realPoint_Bef = pid->realPoint_Now ;
	pid->realPoint_Now = ActualValue ;
	// 特殊化处理函数
	if (pid->PID_Func != NULL)
	{
		pid->PID_Func() ;
	}
	// 微分误差:*微分先行*(默认为0,也就是不先行)
	float dError = ((1.0f - pid->d_style)*(pid->PreError - pid->LastError)
              - pid->d_style * (pid->realPoint_Now - pid->realPoint_Bef)) / pid->dt_ms;

	// 累次积分
	pid->SumError += pid->PreError * pid->dt_ms ;
	// *积分限幅*
	if (pid->SumError > pid->ioutMax)
	{
		pid->SumError = pid->ioutMax ;
	}
	else if (pid->SumError < -pid->ioutMax)
	{
		pid->SumError = -pid->ioutMax ;
	}
	// 输出参数
	pid->pout = pid->Kp * pid->PreError ;
	pid->iout = pid->Ki * pid->SumError ;	// 这里还可以进行积分分离+变速积分,后续有需要再加入
	pid->dout = pid->Kd * (1.0f - pid->d_filter) * dError + pid->d_filter * pid->dout  ;		// *不完全微分*(滤波,默认不滤波)
	
	// 得到PID的输出值
	pid->setPoint = pid->pout + pid->iout + pid->dout ;
	
	// 输出死区,死区超过0.1f视为存在死区
	if ( fabs(pid->deadspace) > 0.1f && fabs (pid->setPoint - pid->realPoint_Now) < pid->deadspace )
	{
		pid->SumError = 0.0f ;
	}
	
	// 输出限幅
	if ( pid->setPoint > pid->OutMax ) { pid->setPoint = pid->OutMax ; }
	if ( pid->setPoint < pid->OutMin ) { pid->setPoint = pid->OutMin ; }
}
